# Описание функциональных требований
####  1. Создать таблицы БД с учетом ограничений целостности данных.
####  2. Используя оператор **Select**, выдать следующую информацию
1. по всем компактам – сведения о количестве проданных и оставшихся компактов
одного вида по убыванию разницы;
1. по указанному компакту – сведения о количестве и стоимости компактов, проданных
1. за указанный период;
1. по компакту, купленному максимальное количество раз, – выдать все сведения о нем и музыкальных произведениях(*);
1. по наиболее популярному исполнителю – сведения о количестве проданных
1. компактов с его произведениями(*);
1. по каждому автору – сведения о количестве проданных компактов с его записями и сумме полученных денег.
####  3. Обеспечить с помощью операторов **Insert**, **Update**, **Delete** обновление информации в указанных таблицах.
####  4. Создание функции
Описание: запрещает помещать информацию о продаже компактов в таблицу, если суммарное количество проданных компактов превысит суммарное количество поступивших.
####  5. Создание функции
Описание: за указанный период определяет количество поступивших и проданных компактов по каждому виду. В качестве параметра передать начальную дату периода и конечную дату периода. Результаты занести в специальную таблицу.
####  6. Создание функции
Описание: по заданному коду компакта выводит информацию о результатах его продажи за указанный период.
#### 7. Создать таблицы БД с учетом ограничений целостности данных.
#### 8. Используя оператор Select, выдать следующую информацию:
1.  по всем компактам – сведения о количестве проданных и оставшихся компактов одного вида по убыванию разницы;
1.  по указанному компакту – сведения о количестве и стоимости компактов, проданных за указанный период;
1.  по компакту, купленному максимальное количество раз, – выдать все сведения о нем и музыкальных произведениях(*);
1.  по наиболее популярному исполнителю – сведения о количестве проданных компактов с его произведениями(*);
1.  по каждому автору – сведения о количестве проданных компактов с его записями исумме полученных денег.
1.  Обеспечить с помощью операторов Insert, Update, Delete обновление информации вуказанных таблицах.
#### 9. Создание функции
Описание: запрещает помещать информацию о продаже компактов в таблицу, если суммарное количество проданных компактов превысит суммарное количество поступивших.
#### 10. Создание функции
Описание: за указанный период определяет количество поступивших и проданных компактов по каждому виду. В качестве параметра передать начальную дату периода и конечную дату периода. Результаты занести в специальную таблицу.
#### 11. Создание функции
Описание: по заданному коду компакта выводит информацию о результатах его продажи за указанный период(*).
# Use Case диаграмма
<img width="1096" alt="Screen Shot 2022-04-06 at 03 38 32" src="https://user-images.githubusercontent.com/75728340/161873103-42ddb248-38ef-4ec8-b243-3252dbd856fd.png">
# Текстовые сценарии
В качестве продавца или покупателя, пользователь имеет возможность к определенным действиям, доступным благодаря вышеизложенным пунктам. Пользователь имеет ограничение доступа к информации о компакт-дисках. Главная же задача продавца - добавлять новую информацию о товарах, обновлять ее и удалять. 

